source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/SabaraMG.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="2.01">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>LoteRps</TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:RecepcionarLoteRps><xml>{xmlBodyScape}</xml></ws:RecepcionarLoteRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:RecepcionarLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</RecepcionarLoteRps>
		<GerarNfse versao="2.01">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:GerarNfse><xml>{xmlBodyScape}</xml></ws:GerarNfse></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:GerarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</GerarNfse>
		<CancelarNfse versao="2.01">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Pedido</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:CancelarNfse><xml>{xmlBodyScape}</xml></ws:CancelarNfse></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:CancelarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</CancelarNfse>
		<SubstituirNfse versao="2.01">
			<Descricao>Substituir nota fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Pedido</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<TagLoteAssinatura>SubstituirNfseEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>SubstituicaoNfse</TagLoteAtributoID>
			<TagExtraAssinatura></TagExtraAssinatura>
			<TagExtraAtributoID></TagExtraAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:SubstituirNfse><xml>{xmlBodyScape}</xml></ws:SubstituirNfse></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:SubstituirNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</SubstituirNfse>
		<ConsultarLoteRps versao="2.01">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:ConsultarLoteRps><xml>{xmlBodyScape}</xml></ws:ConsultarLoteRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarLoteRps>
		<ConsultarNfsePorRps versao="2.01">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:ConsultarNfsePorRps><xml>{xmlBodyScape}</xml></ws:ConsultarNfsePorRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfsePorRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarNfseServicoPrestado versao="2.01">
			<Descricao>Consulta NFSe de serviços prestados</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:ConsultarNfseServicoPrestado><xml>{xmlBodyScape}</xml></ws:ConsultarNfseServicoPrestado></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseServicoPrestadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseServicoPrestado>
		<ConsultarNfseServicoTomado versao="2.01">
			<Descricao>Consulta NFSe de serviços tomados</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:ConsultarNfseServicoTomado><xml>{xmlBodyScape}</xml></ws:ConsultarNfseServicoTomado></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseServicoTomadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseServicoTomado>
		<ConsultarNfseFaixa versao="2.01">
			<Descricao>Consulta NFSe por Faixa</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>http://sabara.supernova.com.br:8091/nfe/snissdigitalsvc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:ConsultarNfseFaixa><xml>{xmlBodyScape}</xml></ws:ConsultarNfseFaixa></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseFaixaResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseFaixa>
	</Servicos>
</Configuracoes>